; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v10)
             (pred_8 ?v12 ?v6)
             (pred_10 ?v2 ?v6)
             (pred_1 ?v13 ?v2 )
	     (pred_4 ?v2)
             (pred_6 ?v5)
             (pred_12 ?v12)
             (pred_3 ?v6)
             (pred_9 ?v2)
             (pred_7 ?v12)
             (pred_5 ?v2)
             (pred_2 ))



(:action op_1
:parameters (?v4 ?v11 ?v9 ?v7)
:precondition (and (pred_6 ?v4) (pred_6 ?v11) (pred_12 ?v9) (pred_3 ?v7)
          (pred_11 ?v4 ?v11) (pred_8 ?v9 ?v7)
                   (pred_10 ?v11 ?v7) (pred_4 ?v4) 
                   (pred_9 ?v11) (pred_7 ?v9))
:effect (and  (pred_5 ?v11) (not (pred_9 ?v11))))


(:action op_3
:parameters (?v4 ?v3)
:precondition (and (pred_6 ?v4) (pred_6 ?v3)
               (pred_4 ?v4) (pred_11 ?v4 ?v3) (pred_5 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v4))))

(:action op_4
:parameters (?v4 ?v9)
:precondition (and (pred_6 ?v4) (pred_12 ?v9) 
                  (pred_4 ?v4) (pred_1 ?v9 ?v4) (pred_2 ))
:effect (and (pred_7 ?v9)
   (not (pred_1 ?v9 ?v4)) (not (pred_2 ))))


(:action op_5
:parameters (?v4 ?v8 ?v1)
:precondition (and (pred_6 ?v4) (pred_12 ?v8) (pred_12 ?v1)
                  (pred_4 ?v4) (pred_7 ?v1) (pred_1 ?v8 ?v4))
:effect (and (pred_7 ?v8) (pred_1 ?v1 ?v4)
        (not (pred_7 ?v1)) (not (pred_1 ?v8 ?v4))))

(:action op_2
:parameters (?v4 ?v9)
:precondition (and (pred_6 ?v4) (pred_12 ?v9) 
                  (pred_4 ?v4) (pred_7 ?v9))
:effect (and (pred_2 ) (pred_1 ?v9 ?v4) (not (pred_7 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_26 obj_24 obj_15 obj_28 obj_03 obj_09 obj_08 obj_12 obj_20 obj_27 obj_04 obj_21 obj_10 obj_19 obj_06 obj_16 obj_14 obj_13 obj_18 obj_11 obj_30 obj_25 obj_17 obj_02
    obj_22 obj_29
    obj_05 obj_23 obj_07
    )

    (:init
       (pred_2)

       (pred_6 obj_01)
       (pred_6 obj_26)
       (pred_6 obj_24)
       (pred_6 obj_15)
       (pred_6 obj_28)
       (pred_6 obj_03)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_6 obj_12)
       (pred_6 obj_20)
       (pred_6 obj_27)
       (pred_6 obj_04)
       (pred_6 obj_21)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_11)
       (pred_6 obj_30)
       (pred_6 obj_25)
       (pred_6 obj_17)
       (pred_6 obj_02)
       (pred_3 obj_22)
       (pred_3 obj_29)
       (pred_12 obj_05)
       (pred_12 obj_23)
       (pred_12 obj_07)

       (pred_11 obj_01 obj_03)
       (pred_11 obj_01 obj_26)
       (pred_11 obj_26 obj_09)
       (pred_11 obj_26 obj_24)
       (pred_11 obj_26 obj_01)
       (pred_11 obj_24 obj_08)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_24 obj_26)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_28)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_28 obj_15)
       (pred_11 obj_03 obj_27)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_09 obj_26)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_08 obj_12)
       (pred_11 obj_08 obj_24)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_08)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_27 obj_06)
       (pred_11 obj_27 obj_04)
       (pred_11 obj_27 obj_03)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_04 obj_21)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_27)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_10 obj_13)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_06 obj_27)
       (pred_11 obj_16 obj_30)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_06)
       (pred_11 obj_14 obj_25)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_10)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_11 obj_30)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_30 obj_25)
       (pred_11 obj_30 obj_16)
       (pred_11 obj_30 obj_11)
       (pred_11 obj_25 obj_17)
       (pred_11 obj_25 obj_14)
       (pred_11 obj_25 obj_30)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_25)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_02 obj_17)
       (pred_9 obj_02)
       (pred_9 obj_15)
       (pred_9 obj_14)
       (pred_10  obj_02 obj_22)
       (pred_10  obj_15 obj_29)
       (pred_10  obj_14 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_26)
       (pred_5 obj_24)
       (pred_5 obj_28)
       (pred_5 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_08)
       (pred_5 obj_12)
       (pred_5 obj_20)
       (pred_5 obj_27)
       (pred_5 obj_04)
       (pred_5 obj_21)
       (pred_5 obj_10)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_30)
       (pred_5 obj_25)
       (pred_5 obj_17)

       (pred_8  obj_05 obj_22)
       (pred_8  obj_23 obj_29)
       (pred_8  obj_07 obj_29)
       (pred_1 obj_05 obj_26)
       (pred_1 obj_23 obj_27)
       (pred_1 obj_07 obj_12)
       (pred_4 obj_26)
    )

    (:goal (and
       (pred_1 obj_05 obj_03)
       (pred_1 obj_07 obj_15)
    ))
(:constraints
  (always (not (pred_4 obj_24)))
)
)

; plan
1. (op_4 obj_26 obj_05)
   deleted: (pred_1 obj_05 obj_26) (pred_2)
   added: (pred_7 obj_05)
   goals met: 0 of 2
2. (op_3 obj_26 obj_01)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_01)
   goals met: 0 of 2
3. (op_3 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_03)
   goals met: 0 of 2
4. (op_2 obj_03 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_2) (pred_1 obj_05 obj_03)
   goals met: 1 of 2
5. (op_3 obj_03 obj_09)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_09)
   goals met: 1 of 2
6. (op_3 obj_09 obj_08)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_08)
   goals met: 1 of 2
7. (op_3 obj_08 obj_12)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_12)
   goals met: 1 of 2
8. (op_4 obj_12 obj_07)
   deleted: (pred_1 obj_07 obj_12) (pred_2)
   added: (pred_7 obj_07)
   goals met: 1 of 2
9. (op_1 obj_12 obj_15 obj_07 obj_29)
   deleted: (pred_9 obj_15)
   added: (pred_5 obj_15)
   goals met: 1 of 2
10. (op_3 obj_12 obj_15)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_15)
   goals met: 1 of 2
11. (op_2 obj_15 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_2) (pred_1 obj_07 obj_15)
   goals met: 2 of 2
